//---------------------------------------------------------------------------

#include <vcl.h>
#include <string>
#include <iostream>
#pragma hdrstop

#include "Unit3.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm3 *Form3;

//---------------------------------------------------------------------------
__fastcall TForm3::TForm3(TComponent* Owner)
        : TForm(Owner)
{
Memo1->Lines->Text = "Варіант № 6\n";
        Memo1->Lines->Text = Memo1->Lines->Text + "Захаров Денис\n";
        Memo1->Lines->Text = Memo1->Lines->Text + "y1 = rand()\ny2 =y1*6\ny3 = y2 /6\n";
}
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------


void __fastcall TForm3::Memo1Change(TObject *Sender){
AnsiString text = "Виконав Денис Захаров\r\nВаріант №6\r\nЗавдання\r\n1.Зчитує масив (матрицю) з файлу Baza.txt\r\n2.Обчислення суми елементів квадратної матриці\r\n3.Збільшити усі елементи матриці на 6\r\n4.Зчитує масив з файлу Rez.txt\r\n  " ;
Form3->Memo1->Text =  text;

}
//---------------------------------------------------------------------------

